#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601810315]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601810338]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601810323]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601810340]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601810314]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601810335]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601810325]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601810328]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601810320]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601810318]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601810316]
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 0s [id=113600510456]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601810324]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601810322]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601810333]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601810343]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601810344]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601810342]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601810317]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601810336]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601810319]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601810334]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601810332]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601810346]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601810351]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601810352]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601810347]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601810355]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601810363]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601810360]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601810364]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601810380]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601810365]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601810361]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601810383]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601810362]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19808]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601810343" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601810351" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601810324" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601810355" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601810333" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601810352" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601810322" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601810347" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810344" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601810360" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810317" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601810364" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810332" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601810361" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810334" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601810380" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810336" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601810365" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810346" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601810383" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810319" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601810362" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601810342" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601810363" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601810343",
        ] -> (known after apply)
        id                = "113601810351"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601810324",
        ] -> (known after apply)
        id                = "113601810355"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601810333",
        ] -> (known after apply)
        id                = "113601810352"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601810322",
        ] -> (known after apply)
        id                = "113601810347"
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810344",
          - "113601810335",
        ] -> (known after apply)
        id                = "113601810360"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810317",
          - "113601810340",
        ] -> (known after apply)
        id                = "113601810364"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810332",
          - "113601810323",
        ] -> (known after apply)
        id                = "113601810361"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810334",
          - "113601810325",
        ] -> (known after apply)
        id                = "113601810380"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810336",
          - "113601810318",
        ] -> (known after apply)
        id                = "113601810365"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810346",
          - "113601810320",
        ] -> (known after apply)
        id                = "113601810383"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810319",
          - "113601810338",
        ] -> (known after apply)
        id                = "113601810362"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601810342",
          - "113601810328",
        ] -> (known after apply)
        id                = "113601810363"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>